app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ".aslk"], ["description", "/linknqw"], ["created_at", "2019-07-27 19:42:54.382083"], ["updated_at", "2019-07-27 19:42:54.382083"], ["price", 25]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", 32], ["updated_at", "2019-07-22 16:46:23.565238"], ["id", 7]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 15]]
---
  def destroy
    @product = Product.find(params[:id])
    @product.delete