app/views/products/new.html.erb

SELECT "categories".* FROM "categories"
---
       <%= f.text_field :price , class: "form-control" %>
       <%= collection_select(:product, :category_id, Category.all, :id, :name) %>